In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.954575  1.249160
1    a  two  0.249156  0.492285
2    b  one -0.097798  0.711584
3    b  two  0.402822 -2.265701
4    a  one -0.635633  0.151205

In [4]:
grouped = df['data1'].groupby(df['key1'])

grouped.mean()

key1
a    0.189366
b    0.152512
Name: data1, dtype: float64

In [9]:
grouped1 = df[['data1', 'data2']].groupby(df['key2'])

grouped1.mean()

         data1     data2
key2
one   0.073715  0.703983
two   0.325989 -0.886708

In [13]:
grouped2 = df['data1'].groupby([df['key1'], df['key2']])

grouped2.mean()

key1  key2
a     one     0.159471
      two     0.249156
b     one    -0.097798
      two     0.402822
Name: data1, dtype: float64

In [14]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means.unstack()

key2       one       two
key1
a     0.159471  0.249156
b    -0.097798  0.402822

In [16]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 
                   'Ohio'])

years = np.array([2005, 2005, 2006, 2005, 2006])

df['data1'].groupby([states, years]).mean()

California  2005    0.249156
            2006   -0.097798
Ohio        2005    0.678698
            2006   -0.635633
Name: data1, dtype: float64

In [17]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.189366  0.630883
b     0.152512 -0.777058

In [18]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.159471  0.700183
     two   0.249156  0.492285
b    one  -0.097798  0.711584
     two   0.402822 -2.265701

In [19]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [23]:
for name, group in df.groupby('key1'):
    #print(name)
    print(group)

  key1 key2     data1     data2
0    a  one  0.954575  1.249160
1    a  two  0.249156  0.492285
4    a  one -0.635633  0.151205
  key1 key2     data1     data2
2    b  one -0.097798  0.711584
3    b  two  0.402822 -2.265701

In [25]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.954575  1.249160
4    a  one -0.635633  0.151205
a
  key1 key2     data1     data2
1    a  two  0.249156  0.492285
b
  key1 key2     data1     data2
2    b  one -0.097798  0.711584
b
  key1 key2     data1     data2
3    b  two  0.402822 -2.265701

In [26]:
pieces = dict(list(df.groupby('key1')))

pieces['b']

  key1 key2     data1     data2
2    b  one -0.097798  0.711584
3    b  two  0.402822 -2.265701

In [27]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [29]:
gouped = df.groupby(df.dtypes, axis = 1)

grouped.mean()

key1
a    0.189366
b    0.152512
Name: data1, dtype: float64

In [32]:
for dtype, group in grouped:
    print(dtype)
    print(group)

a
0    0.954575
1    0.249156
4   -0.635633
Name: data1, dtype: float64
b
2   -0.097798
3    0.402822
Name: data1, dtype: float64

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  1.949389 -0.057003
1    a  two -0.073672 -1.217763
2    b  one  0.102924  0.316510
3    b  two  0.679555  1.734818
4    a  one  0.650816  1.439741

In [5]:
df.groupby('key1')['data1']

In [6]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     0.691369
      two    -1.217763
b     one     0.316510
      two     1.734818
Name: data2, dtype: float64

In [7]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

s_grouped

In [8]:
s_grouped.mean()

key1  key2
a     one     0.691369
      two    -1.217763
b     one     0.316510
      two     1.734818
Name: data2, dtype: float64

In [9]:
people = pd.DataFrame(np.random.randn(5, 5), columns = list('abcde'), 
                     index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

people

               a         b         c         d         e
Joe     0.445098 -0.192945  1.946648  1.395042  0.036886
Steve  -0.866307  0.083643  1.496190 -0.598366 -0.296912
Wes     0.680667 -0.140235 -1.564906  0.933686  0.966763
Jim    -1.089607 -1.381335  1.138859 -1.605728  0.674444
Travis -0.222292  0.308168 -1.390206  0.058319  0.474194

In [12]:
people.iloc[2:3, [1, 2]] = np.nan

people

               a         b         c         d         e
Joe     0.445098 -0.192945  1.946648  1.395042  0.036886
Steve  -0.866307  0.083643  1.496190 -0.598366 -0.296912
Wes     0.680667       NaN       NaN  0.933686  0.966763
Jim    -1.089607       NaN       NaN -1.605728  0.674444
Travis -0.222292  0.308168 -1.390206  0.058319  0.474194

In [14]:
people.sum(axis = 1)

Joe       3.630729
Steve    -0.181752
Wes       2.581116
Jim      -2.020891
Travis   -0.771816
dtype: float64

In [16]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

print(mapping)

by_column = people.groupby(mapping, axis = 1)

by_column.sum()

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

            blue       red
Joe     3.341690  0.289040
Steve   0.897825 -1.079577
Wes     0.933686  1.647429
Jim    -1.605728 -0.415163
Travis -1.331886  0.560070

In [15]:
map_series = pd.Series(mapping)

map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [17]:
people.groupby(map_series, axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        1    2
Travis     2    3

In [18]:
people.groupby(mapping, axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        1    2
Travis     2    3

In [21]:
len

In [20]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.036158 -0.192945  1.946648  0.723001  1.678093
5 -0.866307  0.083643  1.496190 -0.598366 -0.296912
6 -0.222292  0.308168 -1.390206  0.058319  0.474194

In [22]:
key_list = ['one', 'one', 'one', 'two', 'two']

people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.445098 -0.192945  1.946648  0.933686  0.036886
  two -1.089607       NaN       NaN -1.605728  0.674444
5 one -0.866307  0.083643  1.496190 -0.598366 -0.296912
6 two -0.222292  0.308168 -1.390206  0.058319  0.474194

In [24]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], 
                                    [1, 3, 5, 1, 3]], 
                                   names = ['city', 'tenor'])

hier_df = pd.DataFrame(np.random.randn(4, 5), columns = columns)

hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -0.326746  0.295191 -1.206363 -0.488242 -0.025297
1     -0.021526  1.886042 -0.496326  1.339796 -0.489095
2      0.373664 -1.394337 -0.339941  0.777976 -0.914370
3      0.078146 -1.044773  0.876224 -1.473668 -0.275865

In [25]:
hier_df.groupby(level = 'city', axis = 1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [29]:
hier_df.groupby(level = 'city', axis = 1)